#Задача 6: Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и 
# получали билет с номером. Счастливым билетом называют такой билет с шестизначным номером, 
#где сумма первых трех цифр равна сумме последних трех. 
#Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. 
#Вам требуется написать программу, которая проверяет счастливость билета.

#*Пример:*

#385916 -> yes
#123456 -> no

number = int(input("Введите номер билета "))
number = int(number)
 
num1 = number // 1000
c = num1 % 10
num1_1 = num1 // 10
b = num1_1 % 10
num1_1 = num1_1 // 10
sum1 = num1_1 + b + c

num2 = number % 1000
f = num2 % 10
num2_1 = num2 // 10
e = num2_1 % 10
num2_1 = num2_1 // 10
sum2 = num2_1 + e + f

if sum1 == sum2:
    print ("Yes")
else:
    print ("No")