#Задача 4: Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. 
# Сколько журавликов сделал каждый ребенок, если известно, что Петя и Сережа 
# сделали одинаковое количество журавликов, а Катя сделала в два раза больше журавликов, 
# чем Петя и Сережа вместе?

#*Пример:*

#6 -> 1  4  1
#24 -> 4  16  4
#60 -> 10  40  10

sum = int(input("Введите общее количество журавликов, которое сделали дети "))
sum = int (sum)
if sum%6 ==0:
    print ("Петя сделал журавликов - ", sum/6)
    print ("Сережа сделал журавликов - ", sum/6)
    print ("Катя сделала журавликов - ", 4*sum/6)
else:
    print ("Задача не имеет решения")
